GitHub BOTSv2: https://github.com/splunk/botsv2

SPL (Splunk Search Processing Langauage) 
-command metadata used for searching info found in Data summary with specific index
eg metadata command:
| metadata type=sourcetypes index=botsv2 | eval firstTime=strftime(firstTime,"%Y-%m-%d %H:%M:%S") | eval lastTime=strftime(lastTime,"%Y-%m-%d %H:%M:%S") | eval recentTime=strftime(recentTime,"%Y-%m-%d %H:%M:%S") | sort - totalCount


settings > addData > monitor > [datasetfile location] ... start searching


-------------------------------------------------------------------------------------------------------------------------

100 series questions 

Amber Turing was hoping for Frothly to be acquired by a potential competitor which fell through, but visited their website to find contact information for their executive team. What is the website domain that she visited?
www.berkbeer.com

Amber found the executive contact information and sent him an email. What image file displayed the executive's contact information? Answer example: /path/image.ext
/images/ceoberk.png

What is the CEO's name? Provide the first and last name.
Martin Berk

What is the CEO's email address?
mberk@berkbeer.com

After the initial contact with the CEO, Amber contacted another employee at this competitor. What is that employee's email address?
hbernhard@berkbeer.com

What is the name of the file attachment that Amber sent to a contact at the competitor?
Saccharomyces_cerevisiae_patent.docx

What is Amber's personal email address?
ambersthebest@yeastiebeastie.com

----------------------------------------------------------------------------------------------

Series 200 Questions

What version of TOR Browser did Amber install to obfuscate her web browsing? Answer guidance: Numeric with one or more delimiter.
index="botsv2" amber tor
-image field
-install 7.0.4_en-US.exe

What is the public IPv4 address of the server running www.brewertalk.com?
index="botsv2" brewertalk.com
-dest_ip field
52.42.208.228

Provide the IP address of the system used to run a web vulnerability scan against www.brewertalk.com.
index="botsv2" brewertalk.com
-src_ip field
45.77.65.211

The IP address from Q#2 is also being used by a likely different piece of software to attack a URI path. What is the URI path? Answer guidance: Include the leading forward slash in your answer. Do not include the query string or other parts of the URI. Answer example: /phpinfo.php
index="botsv2" brewertalk.com sourcetype="stream:http" src_ip="45.77.65.211"
-uri_path field
/member.php

What SQL function is being abused on the URI path from the previous question?
index="botsv2" brewertalk.com sourcetype="stream:http" src_ip="45.77.65.211" uri_path="/member.php" | dedup form_data | table form_data
-updatexml

What was the value of the cookie that Kevin's browser transmitted to the malicious URL as part of an XSS attack? Answer guidance: All digits. Not the cookie name or symbols like an equal sign.
index="botsv2" kevin sourcetype="stream:http" tag=error | table cookie
-1502408189

What brewertalk.com username was maliciously created by a spear phishing attack?
-homograph attack impersonate domain names
index="botsv2" 1bc3eab741900ab25c98eee86bf20feb sourcetype="stream:http" brewertalk.com
-form_data field
username: kIagerfield

----------------------------------------------------------------------------------------------------------------------------------------------------------------

Mallory's critical PowerPoint presentation on her MacBook gets encrypted by ransomware on August 18. What is the name of this file after it was encrypted?
index="botsv2" host="MACLORY-AIR13" (*.pptx or *.ppt)
-Frothly_marketing_campaign_Q317.pptx.crypt_


There is a Games of Thrones movie file that was encrypted as well. What season and episode is it? 
index="botsv2" host="MACLORY-AIR13" *.crypt sourcetype=ps
-S07E02

Kevin Lagerfield used a USB drive to move malware onto kutekitten, Mallory's personal MacBook. She ran the malware, which obfuscates itself during execution. Provide the vendor name of the USB drive Kevin likely used. Answer Guidance: Use time correlation to identify the USB drive.
Find malware
index="botsv2" host="kutekitten" sourcetype=osquery_results
-Alcore Micro Corp.
columns.path= /users/mkraeusen/Library
find md5 hash for the malware - look up on virus total
-Perl Script: programming language
-2017-01-17: first seen
-Hybrid Analysis to look up contant domains using the hash
-"eidk.duckdns.org"
-"eidk.hopto.org"

---------------------------------------------------------------------------------------------

400

A Federal law enforcement agency reports that Taedonggang often spear phishes its victims with zip files that have to be opened with a password. What is the name of the attachment sent to Frothly by a malicious Taedonggang actor?
index="botsv2" sourcetype="stream:smtp" *.zip | reverse 
-invoice.zip

What is the password to open the zip file?
content of email
-912345678

The Taedonggang APT group encrypts most of their traffic with SSL. What is the "SSL Issuer" that they use for the majority of their traffic? Answer guidance: Copy the field exactly, including spaces.
index="botsv2" sourcetype="stream:tcp" 45.77.65.211
SSL issuer field
-C = US

What unusual file (for an American company) does winsys32.dll cause to be downloaded into the Frothly environment?
index="botsv2" sourcetype="stream:ftp" method=RETR | reverse
-나는_데이비드를_사랑한다.hwp


What is the first and last name of the poor innocent sap who was implicated in the metadata of the file that executed PowerShell Empire on the first victim's workstation? Answer example: John Smith
Virus Total
-Ryan Kovar

Within the document, what kind of points is mentioned if you found the text?
App.any.run
CyberEastEgg

To maintain persistence in the Frothly network, Taedonggang APT configured several Scheduled Tasks to beacon back to their C2 server. What single webpage is most contacted by these Scheduled Tasks? Answer example: index.php or images.html
index="botsv2" schtasks.exe sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" | dedup ParentCommandLine | table Parent Command Line Command Line
index="botsv2" source=WinRegistry "\\Software\\Microsoft\\Network"| reverse
-data base64 - cyberchef
-process.php


